lib/tasks/one_time.rake

task populate_roles: :environment do
  Role.where(code: 'default').first_or_create.update(name: 'Default')
---
INSERT INTO "roles" ("code", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["code", "servicio"], ["created_at", "2020-10-08 23:42:04.176026"], ["updated_at", "2020-10-08 23:42:04.176026"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."code" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["code", "servicio"], ["LIMIT", 1]]
UPDATE "roles" SET "name" = $1, "updated_at" = $2 WHERE "roles"."id" = $3  [["name", "Servicio"], ["updated_at", "2020-10-08 23:42:04.180139"], ["id", 3]]

task default_roles: :environment do
  default = Role.where(code: 'default')

  User.update_all(role_id: default.ids)
---
SELECT "roles"."id" FROM "roles" WHERE "roles"."code" = $1  [["code", "default"]]
UPDATE "users" SET "role_id" = NULL