app/views/home_page/home.html.erb

                <h1 class="subtitle is-2"><%=@active_users%> Usuarios Activos </h1>
                <h1 class="subtitle is-2"><%=Carrete.count%> Carretes online </h1>
---
SELECT "carretes".* FROM "carretes"
SELECT COUNT(*) FROM "carretes"