app/views/post/show.html.erb

SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."post_id" = $1  [["post_id", 2]]
---
<h2>Comentarios</h2>
<% @post.comentarios.each do |comment| %>