app/controllers/carretes_controller.rb

SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @carrete = Carrete.find(params[:id])

SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def services
    @carrete = Carrete.find(params[:id])

SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @carrete = Carrete.find(params[:id])

SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @carrete = Carrete.find(params[:id])