app/controllers/comentarios_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comentarios" ("author", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "aaaaaaaaaaaaaaa"], ["body", "aaaaaaaaaaaaaaaaaa"], ["post_id", 16], ["created_at", "2020-10-06 20:28:07.965500"], ["updated_at", "2020-10-06 20:28:07.965500"]]
---
	def create
		@post = Post.find(params[:post_id])
		@comentario = @post.comentarios.create(comentario_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."post_id" = $1 AND "comentarios"."id" = $2 LIMIT $3  [["post_id", 16], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 1]]
---
	def destroy
		@post = Post.find(params[:post_id])
		@comentario = @post.comentarios.find(params[:id])
		@comentario.destroy