app/controllers/comunas_controller.rb

  def create
    @comuna = Comuna.new(comuna_params)

    if @comuna.save
---
INSERT INTO "comunas" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "Los Andes"], ["created_at", "2020-11-20 21:40:28.692775"], ["updated_at", "2020-11-20 21:40:28.692775"]]

  def index
    @comuna = Comuna.order(:nombre)
---
SELECT "comunas".* FROM "comunas" ORDER BY "comunas"."nombre" ASC

  def destroy
    @comuna = Comuna.find(params[:id])
    @comuna.destroy
---
SELECT  "comunas".* FROM "comunas" WHERE "comunas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comunas" WHERE "comunas"."id" = $1  [["id", 1]]