app/controllers/home_page_controller.rb

  def home
    @active_users = User.all.count()
---
SELECT COUNT(*) FROM "users"