app/controllers/post_controller.rb

  def index
  	@post = Post.all
---
SELECT "posts".* FROM "posts"

  def create
  	@post = Post.new(post_params)

  	if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-10-06 20:10:59.901431"], ["updated_at", "2020-10-06 20:10:59.901431"]]

  def update
  	@post = Post.find(params[:id])

  	if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "comment" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Hola me ofrezo a limpiar"], ["comment", "Yo me rajo con el Quix"], ["updated_at", "2020-10-06 19:53:57.848342"], ["id", 14]]