app/controllers/profile_controller.rb

UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 2], ["updated_at", "2020-10-08 00:24:58.529091"], ["id", 16]]
---
  def make_service
    @user = current_user
    @user.update_role(2)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 3], ["updated_at", "2020-10-08 00:25:01.090008"], ["id", 16]]
---
  def make_admin
    @user = User.find(params[:id])
    @user.update_role(3)