app/controllers/servicio_controller.rb

SELECT "servicios".* FROM "servicios" WHERE "servicios"."status" = $1  [["status", "aprobado"]]
---
  def index
    @servicio = Servicio.where(status: 'aprobado')

SELECT "servicios".* FROM "servicios" WHERE "servicios"."status" = $1  [["status", "pendiente"]]
---
  def admin_index
    @servicio_pendiente = Servicio.where(status: 'pendiente')

SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @servicio = Servicio.find(params[:id])

SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @servicio = Servicio.find(params[:id])