app/models/user.rb

UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 2], ["updated_at", "2020-10-08 00:24:58.529091"], ["id", 16]]
---
  def update_role(role)
    self.update(role_id: role)

SELECT  "roles".* FROM "roles" WHERE "roles"."code" = $1 LIMIT $2  [["code", "default"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "role_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-10-06 23:12:05.428130"], ["role_id", 1], ["id", 14]]
---
  def set_default_role
    self.update(role_id: Role.find_by(code: 'default').id)