app/views/servicio/new.html.erb

SELECT "comunas".* FROM "comunas"
---
					<p class='title has-text-centered'><%= f.label :comunas %><br /></p>
						<% for comuna in Comuna.all %>