app/views/profile/profile.html.erb

<p>Esta pagina desplega el nombre de usuario y permite customizar algunos atributos</p>
<p>Comuna: <%= Comuna.find(current_user.comunas_id).nombre%><p>
---
SELECT  "comunas".* FROM "comunas" WHERE "comunas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]